import { articliesData } from "../../dummyData";
import "./single-post.scss";
import { useParams } from "react-router-dom";

const SinglePost = () => {
  const { id } = useParams();
  console.log(id);

  const post = articliesData.find((article) => article.id === +id);

  return (
    <div className="single-post">
      <div className="article-img">
        <img src={post.img} alt="" />
      </div>
      <h1>{post.title}</h1>
      <div className="info">
        <div>نویسنده : <strong>{post.author}</strong></div>
        <div>تاریخ انتشار : <strong>{post.publishedDate}</strong></div>
      </div>
      <p className="descriotion">
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
        از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
        سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای
        متنوع با هدف بهبود ابزارهای کاربردی می باشد، کاربردهای متنوع با هدف
        بهبود ابزارهای کاربردی می باشد. لورم ایپسوم متن ساختگی با تولید سادگی
        نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون
        بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی
        تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می
        باشد، کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. لورم ایپسوم
        متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که
        لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف
        بهبود ابزارهای کاربردی می باشد، کاربردهای متنوع با هدف بهبود ابزارهای
        کاربردی می باشد. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت
        چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و
        مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
        نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کاربردهای
        متنوع با هدف بهبود ابزارهای کاربردی می باشد. لورم ایپسوم متن ساختگی با
        تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
        چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و
        برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود
        ابزارهای کاربردی می باشد، کاربردهای متنوع با هدف بهبود ابزارهای کاربردی
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
        از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
        سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای
        متنوع با هدف بهبود ابزارهای کاربردی می باشد، کاربردهای متنوع با هدف
        بهبود ابزارهای کاربردی می باشد. می باشد.
      </p>
    </div>
  );
};

export default SinglePost;
